[
  {
    "id": 1,
    "image": "/images/demo-app1.png",
    "title": "TaskMaster",
    "companyName": "Productive Labs",
    "description": "TaskMaster is designed to make your day highly productive by providing a complete task management system. You can categorize tasks, set priorities, create deadlines, and receive smart reminders. Its intuitive interface allows you to break large projects into smaller actionable steps, track progress, and visualize daily, weekly, and monthly productivity trends. Integration with calendars and notifications ensures you never miss a task. Moreover, TaskMaster provides detailed insights into your work habits, helping you identify bottlenecks, reduce procrastination, and optimize your workflow efficiently. Suitable for students, professionals, and teams looking to enhance collaboration and time management.",
    "size": 45,
    "reviews": 1240,
    "ratingAvg": 4.5,
    "downloads": "120K",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 60 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 420 },
      { "name": "5 star", "count": 540 }
    ]
  },
  {
    "id": 2,
    "image": "/images/demo-app2.png",
    "title": "NoteFlow",
    "companyName": "FlowSoft",
    "description": "NoteFlow is your ultimate note-taking companion, designed to capture ideas, thoughts, and important information quickly. With rich text formatting, tagging, search capabilities, and cloud synchronization, you can organize notes across multiple devices effortlessly. It allows creating hierarchical notebooks, linking notes for research projects, and embedding media such as images, audio, and PDFs. Perfect for students, professionals, and creatives, NoteFlow helps streamline information, increase productivity, and ensures you never lose track of your thoughts. Advanced features include version history, collaborative editing, and reminders for action items.",
    "size": 32,
    "reviews": 980,
    "ratingAvg": 4.3,
    "downloads": "95K",
    "ratings": [
      { "name": "1 star", "count": 30 },
      { "name": "2 star", "count": 55 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 360 },
      { "name": "5 star", "count": 385 }
    ]
  },
  {
    "id": 3,
    "image": "/images/demo-app3.png",
    "title": "FitTrack",
    "companyName": "Healthify",
    "description": "FitTrack is a comprehensive fitness app that allows users to monitor workouts, track calories, set fitness goals, and analyze performance over time. It provides personalized workout plans based on your fitness level, available equipment, and preferred exercise types. Users can log exercises, track heart rate, monitor weight progress, and record daily activity. With motivational challenges, streak tracking, and achievements, FitTrack encourages consistent training. Additionally, it offers nutrition tracking, integration with wearable devices, and community features to share achievements and stay motivated. Ideal for fitness enthusiasts seeking to improve health, endurance, and overall well-being.",
    "size": 60,
    "reviews": 2100,
    "ratingAvg": 4.6,
    "downloads": "300K",
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 70 },
      { "name": "3 star", "count": 220 },
      { "name": "4 star", "count": 650 },
      { "name": "5 star", "count": 1110 }
    ]
  },
  {
    "id": 4,
    "image": "/images/demo-app4.png",
    "title": "MoneyWise",
    "companyName": "FinTech Hub",
    "description": "MoneyWise is an intelligent personal finance app designed to help you gain complete control over your money. You can track income and expenses, create budgets, categorize spending, and set financial goals. MoneyWise offers in-depth analytics, visual charts, and alerts for unusual spending patterns. The app also helps in planning savings, monitoring investments, and predicting future cash flow. With secure cloud backup and bank account integration, you can effortlessly manage multiple accounts in one place. MoneyWise is perfect for individuals and families who want to optimize spending, save effectively, and achieve financial freedom with actionable insights and real-time guidance.",
    "size": 40,
    "reviews": 1500,
    "ratingAvg": 4.4,
    "downloads": "180K",
    "ratings": [
      { "name": "1 star", "count": 45 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 210 },
      { "name": "4 star", "count": 520 },
      { "name": "5 star", "count": 645 }
    ]
  },
  {
    "id": 5,
    "image": "/images/demo-app5.png",
    "title": "FocusTimer",
    "companyName": "DeepWork Inc",
    "description": "FocusTimer leverages the Pomodoro technique to enhance concentration and productivity. The app allows users to create focused work sessions with customizable timers, short breaks, and long breaks, encouraging sustained attention without burnout. Users can track daily and weekly progress, analyze productivity patterns, and set personal goals. FocusTimer also includes motivational streaks, achievement badges, and task integration, ensuring that both simple tasks and complex projects are managed effectively. It is ideal for students, professionals, and remote workers seeking to structure work hours, reduce procrastination, and maximize output.",
    "size": 25,
    "reviews": 670,
    "ratingAvg": 4.2,
    "downloads": "72K",
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 45 },
      { "name": "3 star", "count": 120 },
      { "name": "4 star", "count": 260 },
      { "name": "5 star", "count": 220 }
    ]
  },
  {
    "id": 6,
    "image": "/images/demo-app6.png",
    "title": "StudyBuddy",
    "companyName": "EduCore",
    "description": "StudyBuddy is a powerful educational assistant that helps learners plan study schedules, track learning progress, and stay consistent. The app allows creating subjects, topics, and subtopics, and setting deadlines for each. Students can monitor their strengths and weaknesses through analytics, get reminders for pending tasks, and maintain a productive study routine. StudyBuddy also includes revision tracking, goal achievements, and motivational insights, ensuring a structured approach to learning. Suitable for students, competitive exam aspirants, and lifelong learners who want to maximize learning efficiency and retention.",
    "size": 48,
    "reviews": 890,
    "ratingAvg": 4.4,
    "downloads": "110K",
    "ratings": [
      { "name": "1 star", "count": 28 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 160 },
      { "name": "4 star", "count": 310 },
      { "name": "5 star", "count": 342 }
    ]
  },
  {
    "id": 7,
    "image": "/images/demo-app1.png",
    "title": "DailyHabit",
    "companyName": "HabitWorks",
    "description": "DailyHabit is designed to help users develop positive habits through reminders, streak tracking, and goal management. You can create daily routines, monitor consistency, and receive detailed progress analytics. The app encourages self-discipline by rewarding streaks, providing insights into habit patterns, and offering tips to overcome challenges. Integration with notifications ensures habits are not missed, while motivational achievements keep users engaged. DailyHabit is ideal for individuals looking to build healthier routines, improve productivity, and maintain long-term behavioral changes.",
    "size": 35,
    "reviews": 760,
    "ratingAvg": 4.3,
    "downloads": "98K",
    "ratings": [
      { "name": "1 star", "count": 22 },
      { "name": "2 star", "count": 48 },
      { "name": "3 star", "count": 145 },
      { "name": "4 star", "count": 275 },
      { "name": "5 star", "count": 270 }
    ]
  },
  {
    "id": 8,
    "image": "/images/demo-app2.png",
    "title": "CloudDocs",
    "companyName": "Syncify",
    "description": "CloudDocs offers secure cloud storage and document management for individuals and teams. Users can upload, organize, and share files seamlessly, with advanced permissions for privacy. It supports multiple formats, offline access, and automatic synchronization across devices. CloudDocs also includes version history, collaborative editing, and real-time notifications, making it easy to manage personal and professional documents efficiently. Perfect for remote teams, students, and professionals, it ensures important files are safe, organized, and accessible anywhere at any time.",
    "size": 70,
    "reviews": 1340,
    "ratingAvg": 4.5,
    "downloads": "220K",
    "ratings": [
      { "name": "1 star", "count": 38 },
      { "name": "2 star", "count": 62 },
      { "name": "3 star", "count": 190 },
      { "name": "4 star", "count": 460 },
      { "name": "5 star", "count": 590 }
    ]
  },
  {
    "id": 9,
    "image": "/images/demo-app3.png",
    "title": "QuickScan",
    "companyName": "ScanTech",
    "description": "QuickScan turns your phone into a high-quality document scanner. Capture receipts, contracts, notes, or books and convert them to PDFs or images instantly. It includes automatic edge detection, perspective correction, and OCR capabilities to extract text. Users can organize scanned documents, add tags, and securely share with others. QuickScan is perfect for students, professionals, and small businesses that need a fast, reliable, and portable scanning solution without bulky hardware, ensuring documents are always accessible and easy to manage.",
    "size": 28,
    "reviews": 520,
    "ratingAvg": 4.1,
    "downloads": "60K",
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 35 },
      { "name": "3 star", "count": 110 },
      { "name": "4 star", "count": 190 },
      { "name": "5 star", "count": 165 }
    ]
  },
  {
    "id": 10,
    "image": "/images/demo-app4.png",
    "title": "MindRelax",
    "companyName": "CalmSpace",
    "description": "MindRelax is a meditation and relaxation app designed to reduce stress, improve focus, and enhance mental well-being. It provides guided meditation sessions, breathing exercises, and mindfulness practices tailored for beginners and advanced users. The app tracks meditation streaks, sleep patterns, and mood changes, helping users understand and manage stress effectively. With customizable session lengths, ambient sounds, and progress analytics, MindRelax supports users in achieving a balanced lifestyle, better sleep, and a calm, focused mind.",
    "size": 55,
    "reviews": 1680,
    "ratingAvg": 4.7,
    "downloads": "260K",
    "ratings": [
      { "name": "1 star", "count": 35 },
      { "name": "2 star", "count": 55 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 520 },
      { "name": "5 star", "count": 890 }
    ]
  },
  {
    "id": 11,
    "image": "/images/demo-app5.png",
    "title": "LinguaLearn",
    "companyName": "Polyglot Labs",
    "description": "LinguaLearn is a comprehensive language learning app that offers interactive lessons, speaking exercises, quizzes, and real-world conversation practice. Users can choose from multiple languages, track their progress, and participate in daily challenges to improve vocabulary and grammar. The app includes speech recognition, flashcards, and cultural tips to ensure holistic language acquisition. Perfect for beginners and advanced learners, LinguaLearn provides a flexible and engaging approach to mastering new languages at your own pace.",
    "size": 65,
    "reviews": 1250,
    "ratingAvg": 4.6,
    "downloads": "140K",
    "ratings": [
      { "name": "1 star", "count": 35 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 180 },
      { "name": "4 star", "count": 410 },
      { "name": "5 star", "count": 575 }
    ]
  },
  {
    "id": 12,
    "image": "/images/demo-app6.png",
    "title": "TuneWave",
    "companyName": "MelodyWorks",
    "description": "TuneWave is a music streaming app that allows users to explore millions of songs, create playlists, and share their favorite tracks with friends. The app offers personalized recommendations based on listening habits, offline downloads for uninterrupted listening, and high-quality audio streaming. Additionally, TuneWave includes lyrics integration, radio channels, podcasts, and social features that enable music lovers to discover, enjoy, and connect over music seamlessly.",
    "size": 58,
    "reviews": 1340,
    "ratingAvg": 4.5,
    "downloads": "210K",
    "ratings": [
      { "name": "1 star", "count": 28 },
      { "name": "2 star", "count": 45 },
      { "name": "3 star", "count": 160 },
      { "name": "4 star", "count": 420 },
      { "name": "5 star", "count": 687 }
    ]
  }
]
